ЕСКД/src/Documents/mega_ЗакрытиеЗаявокВнутренних/mega_ЗакрытиеЗаявокВнутренних.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>mega_ЗакрытиеЗаявокВнутренних</name>
  <registerRecords>AccumulationRegister.mega_ЗавкиВнутренние</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ЗаявкаВнутренняя</name>
      <type>
        <types>DocumentRef.mega_ЗаявкаВнутренняя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕСКД/src/AccumulationRegisters/mega_ЗавкиВнутренние/mega_ЗавкиВнутренние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>mega_ЗавкиВнутренние</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПотребности</name>
    <type>
      <types>DocumentRef.mega_ЗаявкаВнутренняя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.mega_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕСКД/src/Documents/mega_ЗакрытиеЗаявокВнутренних/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоОстаткам()Экспорт
	
	Если ЭтоНовый() Тогда
		
		ДатаСреза = ТекущаяДатаСеанса();
	Иначе
		
		ДатаСреза = Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗавкиВнутренниеОстатки.ДокументПотребности КАК ЗаявкаВнутренняя
		|ИЗ
		|	РегистрНакопления.mega_ЗавкиВнутренние.Остатки(&ДатаСреза,) КАК ЗавкиВнутренниеОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументПотребности";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Состав.Добавить();
		НоваяСтрока.ЗаявкаВнутренняя = ВыборкаДетальныеЗаписи.ЗаявкаВнутренняя;
	КонецЦикла;
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	ДатаСреза = Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВидДвижения КАК ВидДвижения,
	|	&Период КАК Период,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	Остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Остатки.ДокументПотребности КАК ДокументПотребности,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.mega_ЗавкиВнутренние.Остатки(&ДатаСреза, ДокументПотребности В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Состав.ЗаявкаВнутренняя
	|		ИЗ
	|			Документ.mega_ЗакрытиеЗаявокВнутренних.Состав КАК Состав
	|		ГДЕ
	|			Состав.Ссылка = &Регистратор)) КАК Остатки";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
    		
	РегистрыНакопления.mega_ЗавкиВнутренние.ВыполнитьДвижение(ЭтотОбъект.Ссылка, Выборка);	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
